In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [3]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [4]:
data.loc['Utah',['two','three']]

two       9
three    10
Name: Utah, dtype: int64

Pg-128 See all the ways you can obtain values from dataframe

In [5]:
data.xs('one',axis=1)

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [17]:
data.xs('Ohio')

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int64

In [18]:
data.loc['Utah']

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64